#+title: Inbox
#+OPTIONS: toc:nil author:nil date:nil prop:t p:t

* TODO 考取 GDE
SCHEDULED: <2026-01-07 Wed>
https://developers.google.com/community/experts#how_do_i_apply
https://developers.google.com/static/community/experts/assets/GDE_Program_Application_Guide.pdf

** Apply
- https://g.dev/hamber
  hamberluo@gmail.com
- https://g.dev/panthole
- https://g.dev/shixin
- https://g.dev/qiaoyuang

* TODO 预订澳新机票酒店
SCHEDULED: <2025-12-30 Tue>

** TODO 新西兰租车
SCHEDULED: <2025-12-30 Tue>
[[https://www.xiaohongshu.com/explore/6915584e0000000005000d33?xsec_token=ABwRRgJUt6OUe1P-x05DgTgI4mruWpneEZFXg9x8qUiuc=&xsec_source=pc_search&source=unknown][新西兰租车小窍门，省了1000+ - 小红书]]
https://www.ezicarrental.co.nz
https://www.apexrentals.co.nz/zh-cn/reservations/location

*** TODO 确定新西兰自驾线路
SCHEDULED: <2025-12-30 Tue>

*** TODO 驾照翻译件
SCHEDULED: <2026-01-09 Fri>
https://www.nzta.govt.nz/driver-licences/new-residents-and-visitors/approved-translators

* TODO Google AI Pro
https://one.google.com/ai-nye

* KILL 修复 kotlin-ts-mode 在 org mode 中的高亮
SCHEDULED: <2025-12-09 Tue>
:LOGBOOK:
CLOCK: [2025-12-11 Thu 08:26]--[2025-12-11 Thu 08:43] =>  0:17
:END:

* TODO Homelab in 小窝
SCHEDULED: <2025-12-01 Mon>

* TODO AI 根据 ISO 生成 Kotlin 语言的高频、超高频解码库

* TODO 跨所有客户端的书签同步工具
SCHEDULED: <2025-11-25 Tue>
- Floccus
- Raindrop.io

** TODO 用 AI 创建根据文件修改 Safari 的浏览器插件
SCHEDULED: <2025-12-09 Tue>

* TODO 分体键盘键位分配
SCHEDULED: <2025-11-06 Thu>
https://www.reddit.com/r/ErgoMechKeyboards/comments/1cuawom/are_home_row_modifiers_really_the_best_options/
https://github.com/caksoylar/keymap-drawer/blob/main/PHYSICAL_LAYOUTS.md#qmk-infojson-specification
https://github.com/the-via/qmk_userspace_via/blob/main/keyboards/meetlab/kalice/keymaps/via/keymap.c

https://getreuer.info/posts/keyboards/alt-layouts/index.html
https://getreuer.info/posts/keyboards/symbol-layer/index.html
https://filiphalas.com/my-journey-zsa-voyager-miryoku-colemak-dh

** DONE Add new shield for Silakka54
SCHEDULED: <2025-11-12 Wed>
https://github.com/zmkfirmware/zmk/blob/main/app/dts/layouts/kata0510/lily58.dtsi
https://github.com/Squalius-cephalus/silakka54/blob/main/firmware/keymaps/vial/vial.json

** KILL Tools
https://yal-tools.github.io/vial-to-keymap-drawer/
https://keymap-drawer.streamlit.app/
https://nickcoutsos.github.io/keymap-layout-tools/
https://config.qmk.fm/#/chalice/LAYOUT_default
https://usevia.app/design

* TODO Crypto Automation
SCHEDULED: <2025-11-12 Wed>
https://www.freqtrade.io/en/stable/
https://github.com/ccxt/ccxt

* TODO Relocate Zotero translators
SCHEDULED: <2025-09-25 Thu>
https://github.com/zepinglee/zotero-translators-zh

* TODO 更新 HomeAssistant
SCHEDULED: <2025-09-05 Fri>

** TODO Update Frigate
SCHEDULED: <2025-09-01 Mon>
https://docs.frigate.video/integrations/home-assistant/
https://github.com/blakeblackshear/frigate-hass-integration

*** TODO Setup HACS
https://www.hacs.xyz

* TODO Android jks file from Pass

* TODO 使用 Matrix 代理 WeChat
SCHEDULED: <2025-08-07 Thu>
https://matrix.org/ecosystem/bridges/
https://github.com/duo/matrix-wechat

* TODO 旅行路书
SCHEDULED: <2025-08-07 Thu>

* TODO Use Apple Container

* TODO 迁移照片
SCHEDULED: <2025-06-12 Thu>

* TODO AI Agent

** TODO MCP Server

*** TODO Figma

*** TODO Android Studio

*** TODO Jira

*** DONE Context7
https://github.com/upstash/context7
https://context7.com/dashboard

** TODO MCP Client

*** TODO Raycast

*** TODO Amazon Q

*** TODO Claude Code

*** TODO Gemini CLI

*** DONE Codex

*** TODO Goose
**** KILL Recipes
CLOSED: [2025-12-01 Mon 18:36] SCHEDULED: <2025-10-23 Thu>
- State "KILL"       from "TODO"       [2025-12-01 Mon 18:36]
https://block.github.io/goose/docs/guides/recipes/recipe-reference/
https://block.github.io/goose/docs/guides/recipes/session-recipes/#configure-recipe-location

*** TODO Emacs
https://github.com/lizqwerscott/mcp.el

* TODO Meta 眼镜

** TODO 自动同步

** TODO AI

*** TODO 家庭网络透明代理
SCHEDULED: <2025-06-20 Fri>
https://github.com/LongLights/sing-box_template_merge_sub-store/blob/main/sing-box_v1.13/realip模板（仅ipv4）/singbox_realip.json

**** DONE sing-box research
SCHEDULED: <2025-09-01 Mon>
:LOGBOOK:
CLOCK: [2025-11-04 Tue 09:15]--[2025-11-04 Tue 11:40] =>  2:25
:END:

* TODO 汇丰(HKBC) 入金
* TODO 添加 macOS 系统词典
https://www.zhihu.com/question/20428599
https://kaihao.io/2018/mdict-to-macos-dictionary/
https://github.com/jjgod/mac-dictionary-kit
https://sspai.com/post/43155

* TODO Blog
https://github.com/chuxubank/chuxubank.github.io
SCHEDULED: <2025-02-17 Mon>
** TODO GPG 相关密钥导出为 QR
*** Android
#+begin_src sh
  gpg --import --pinentry-mode=loopback ~/storage/downloads/secret-keys.pgp
#+end_src
** IDEA 打印邮箱中的发票
可以使用 mu4e 进行筛选（正则）
然后定义 ~mu4e-attachment-dir~ 到对应的文件夹
然后 ~C-u mu4e-view-save-attachments~ 保存附件

** IDEA Chezmoi manage macOS Preferences
#+begin_src sh
  set -e
  TMPFILE=$(mktemp)
  trap "cat $TMPFILE; rm $TMPFILE" EXIT

  function pl() {
      CURRENT=$(plutil -extract $1 raw $TMPFILE 2>/dev/null || :)
      if [ "$CURRENT" != "$3" ]; then
          plutil -replace $* "$TMPFILE"
      fi
  }

  cat <&0 >$TMPFILE

  if [ ! -s $TMPFILE ]; then
      plutil -create binary1 $TMPFILE
  fi
#+end_src
** PDF 扫描
- Note taken on [2025-04-22 Tue 16:01] \\
  https://x.com/digitalychee/status/1914556025170223371?s=46&t=hN2xsAOqv7K2si8OImIqAw

* STRT 学习 Rust
SCHEDULED: <2025-07-27 Sun>
https://github.com/google/comprehensive-rust

** TODO 制作 Rust 命令行工具并开源

* TODO 重构 Ansible
SCHEDULED: <2025-06-03 Tue>
:PROPERTIES:
:TRIGGER:  next-sibling scheduled!("++0d")
:END:
https://github.com/IronicBadger/ansible-role-docker-compose-generator

** TODO 使用 Ansible 优化 HomeLab
:PROPERTIES:
:TRIGGER:  next-sibling scheduled!("++0d")
:END:
https://docs.ansible.com/projects/ansible/latest/collections/community/proxmox/index.html
https://docs.ansible.com/projects/ansible/latest/collections/community/proxmox/proxmox_module.html
https://pve.proxmox.com/wiki/Proxmox_VE_API#API_URL
https://openwrt.org/docs/guide-user/additional-software/opkg

*** TODO Setup OpenWrt
SCHEDULED: <2025-11-15 Sat>
:PROPERTIES:
:TRIGGER: next-sibling scheduled!("++0d")
:END:
https://docs.ansible.com/projects/ansible/latest/collections/community/general/openwrt_init_module.html
https://docs.ansible.com/projects/ansible/latest/collections/community/general/opkg_module.html

*** TODO Lucky
[[https://ljmeng.site/posts/16549/#SOHUCS][【教程】Lucky配合Cloudflare更安全的访问局域网服务 | 岂曰无衣的博客]]

* TODO Conventions
- https://keepachangelog.com/
- https://semver.org/
- https://www.conventionalcommits.org/

* TODO IPTV
SCHEDULED: <2025-07-26 Sat>
- Note taken on [2024-04-05 Fri 06:52] \\
  https://github.com/lizongying/my-tv

* DONE 修复地下室网关 M1S
SCHEDULED: <2025-06-20 Fri>

* TODO 基于 TrueNAS 搭建 nextCloud 私有云
:PROPERTIES:
:TRIGGER:  next-sibling scheduled!("++0d")
:END:

* TODO 整理 Download 文件夹
:PROPERTIES:
:BLOCKER:  previous-sibling
:END:

* TODO Coin Bot
https://github.com/freqtrade/freqtrade

* STRT 准备面试
SCHEDULED: <2025-12-02 Tue>
https://github.com/yangshun/tech-interview-handbook

** STRT 刷算法题
SCHEDULED: <2025-12-02 Tue>
:LOGBOOK:
CLOCK: [2025-12-02 Tue 22:18]--[2025-12-02 Tue 22:40] =>  0:22
:END:
https://www.techinterviewhandbook.org/grind75/?difficulty=Medium&difficulty=Hard&difficulty=Easy&hours=8&weeks=8

** STRT 投递简历
https://job.toutiao.com/referral/mobile/position?token=MzsxNzEyODg4ODc0ODEwOzcyOTU1Njc4MzgzODc0MjI3NDY7MDsx

* TODO 学习日语

* TODO 国际驾照

* TODO 学习拍照
[[https://sspai.com/post/68186][泛用、简单、易出片——这款滤镜为照片增加胶片质感]]
Fuji Classic Negative
https://www.opaterny.com/notes/2015/1/12/get-classic-chrome-on-the-fujifilm-x100-and-x100s-with-this-lightroom-preset

* TODO Update CV
SCHEDULED: <2025-12-11 Thu>
** TODO Update LinkedIn
SCHEDULED: <2025-12-11 Thu>

** TODO Add CI/CD tech
- Fastlane
- Concourse

** TODO Add Ansible tech

** TODO Add use MCP/ACP AI agent tools
